#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Quoted keywords are deprecated

  on ec2.tf line 84, in resource "null_resource" "provision_k3s_control_plane":
  84:     when = "create"

In this context, keywords are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted keywords are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this keyword to silence this warning.

(and one more similar warning elsewhere)
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_ami.ubuntu: Reading...
aws_cloudwatch_log_group.vpc_flow_logs: Refreshing state... [id=/aws/vpc/flow-logs]
aws_iam_role.vpc_flow_logs_role: Refreshing state... [id=rs-vpc-flow-logs-role-dev]
aws_vpc.main: Refreshing state... [id=vpc-0dc5d10db85d01a5d]
aws_iam_policy.ssm_cert_read_policy: Refreshing state... [id=arn:aws:iam::767398122881:policy/rs-ssm-cert-read-policy-dev]
aws_kms_key.cloudwatch: Refreshing state... [id=8e8caec0-0a38-4cba-8e72-7f25a422c9c9]
aws_eip.nat: Refreshing state... [id=eipalloc-035f851b0e2f57981]
data.aws_ssm_parameter.ssh_key: Reading...
aws_iam_role.ssm_role: Refreshing state... [id=rs-bastion-ssm-role-dev]
aws_iam_role_policy_attachment.vpc_flow_logs_policy: Refreshing state... [id=rs-vpc-flow-logs-role-dev-20250625212446827100000002]
aws_iam_role_policy_attachment.ssm_attach: Refreshing state... [id=rs-bastion-ssm-role-dev-20250625212446821800000001]
aws_iam_instance_profile.ssm_profile: Refreshing state... [id=rs-bastion-instance-profile-dev]
data.aws_ssm_parameter.ssh_key: Read complete after 0s [id=/development/KEYPAIR]
local_file.ssh_key: Refreshing state... [id=4edc0d98a397011e99505d24aad17357304656d0]
data.aws_ami.ubuntu: Read complete after 1s [id=ami-0d4d7e98021b6b9a6]
aws_flow_log.vpc_flow: Refreshing state... [id=fl-0d77d5cf41cddce2a]
aws_subnet.private[1]: Refreshing state... [id=subnet-08f80fa9510356ba7]
aws_subnet.private[0]: Refreshing state... [id=subnet-04d943fd2a7295403]
aws_internet_gateway.igw: Refreshing state... [id=igw-02ac74f0cef920c8d]
aws_security_group.bastion_sg: Refreshing state... [id=sg-09596d841f2c7ee2d]
aws_subnet.public[1]: Refreshing state... [id=subnet-0fe99464e281008fb]
aws_security_group.vm_public_sg: Refreshing state... [id=sg-07658abe6df96836c]
aws_subnet.public[0]: Refreshing state... [id=subnet-00c91838e70b250ba]
aws_route_table.public: Refreshing state... [id=rtb-0c3b34d18de5d1760]
aws_network_acl.private: Refreshing state... [id=acl-054114683f6a5e47b]
aws_security_group.vm_private_sg: Refreshing state... [id=sg-08ca9ca45d95a2fc2]
aws_nat_gateway.natgw: Refreshing state... [id=nat-04cf83dbcd468bab9]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-01f2e128d3c50bd93]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-012ed53f5e80737b4]
aws_network_acl.public: Refreshing state... [id=acl-0cbb072ba55b023b4]
aws_instance.bastion: Refreshing state... [id=i-0a708fdbc80f10dd9]
aws_network_acl_rule.private_inbound_icmp_vpc: Refreshing state... [id=nacl-3773101390]
aws_network_acl_rule.private_outbound_all: Refreshing state... [id=nacl-3278205305]
aws_network_acl_rule.private_inbound_all_vpc: Refreshing state... [id=nacl-1925476212]
aws_network_acl_rule.private_inbound_ephemeral: Refreshing state... [id=nacl-3413738200]
aws_instance.k3s_worker: Refreshing state... [id=i-07c471f5a14d3076c]
aws_instance.k3s_control_plane: Refreshing state... [id=i-0652c4351164ecb8b]
aws_route_table.private: Refreshing state... [id=rtb-0a3c41114140895bc]
aws_network_acl_rule.public_inbound_all: Refreshing state... [id=nacl-2710135213]
aws_network_acl_rule.public_outbound_all: Refreshing state... [id=nacl-1486836510]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0dc96fadafdf852ef]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-07825d3bf5082c66e]
null_resource.provision_k3s_control_plane: Refreshing state... [id=2614213667581765565]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group.bastion_sg will be updated in-place
  ~ resource "aws_security_group" "bastion_sg" {
        id                     = "sg-09596d841f2c7ee2d"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "176.118.48.254/32",
                ]
              - description      = "Allow SSH from trusted CIDR"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow SSH from trusted CIDR"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
        name                   = "rs-sg-bastion-dev"
        tags                   = {
            "Name" = "rs-sg-bastion-dev"
        }
        # (8 unchanged attributes hidden)
    }

  # local_file.ssh_key will be created
  + resource "local_file" "ssh_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "./blackbird.pem"
      + id                   = (known after apply)
    }

  # null_resource.delete_key_file will be created
  + resource "null_resource" "delete_key_file" {
      + id = (known after apply)
    }

  # null_resource.provision_k3s_control_plane is tainted, so must be replaced
-/+ resource "null_resource" "provision_k3s_control_plane" {
      ~ id = "2614213667581765565" -> (known after apply)
    }

  # null_resource.provision_k3s_worker will be created
  + resource "null_resource" "provision_k3s_worker" {
      + id = (known after apply)
    }

Plan: 4 to add, 1 to change, 1 to destroy.

Warning: Quoted keywords are deprecated

  on ec2.tf line 84, in resource "null_resource" "provision_k3s_control_plane":
  84:     when = "create"

In this context, keywords are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted keywords are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this keyword to silence this warning.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: output.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "output.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @isbelevtsov, Action: `pull_request`, Working Directory: `task_3/project`, Workflow: `Terraform Plan and Apply`*